In [2]:
import pandas as pd

In [7]:
valores = [6, 8, 'azyk',{'key':'values'}, (3,)]
indice = range (len(valores))

serie1 = pd.Series(data= valores, index=indice) 
serie1

0                    6
1                    8
2                 azyk
3    {'key': 'values'}
4                 (3,)
dtype: object

In [8]:
valores2= [28,45,-852, 3,16]
serie2= pd.Series(index=indice, data= valores2) 
serie2

0     28
1     45
2   -852
3      3
4     16
dtype: int64

In [12]:
import numpy as np

In [13]:
array= np.random.normal(-10,10,size=[4,4])
array

array([[-21.99673414, -23.07076273, -17.5929768 ,  -2.16617303],
       [-15.64594934,  -4.18286618, -13.2153799 ,  -9.37897647],
       [ -6.77528693, -13.21380101, -22.03717431, -27.54779479],
       [  2.74544951, -16.29988096, -14.93883178,  -9.70909424]])

In [26]:
pd.DataFrame([[2,3],[4,5]], index=['a','b'], columns= ['W','X'])

   W  X
a  2  3
b  4  5

In [25]:
pd.DataFrame(array)

           0          1          2          3
0 -21.996734 -23.070763 -17.592977  -2.166173
1 -15.645949  -4.182866 -13.215380  -9.378976
2  -6.775287 -13.213801 -22.037174 -27.547795
3   2.745450 -16.299881 -14.938832  -9.709094

In [27]:
len(array)

4

In [29]:
df=pd.DataFrame(array, index= range(1, len(array)+1))
df

           0          1          2          3
1 -21.996734 -23.070763 -17.592977  -2.166173
2 -15.645949  -4.182866 -13.215380  -9.378976
3  -6.775287 -13.213801 -22.037174 -27.547795
4   2.745450 -16.299881 -14.938832  -9.709094

In [38]:
df=pd.DataFrame(array, index= range(1, len(array)+1), columns=['W','X','Y','Z'])
df

           W          X          Y          Z
1 -21.996734 -23.070763 -17.592977  -2.166173
2 -15.645949  -4.182866 -13.215380  -9.378976
3  -6.775287 -13.213801 -22.037174 -27.547795
4   2.745450 -16.299881 -14.938832  -9.709094

In [39]:
df['X']

1   -23.070763
2    -4.182866
3   -13.213801
4   -16.299881
Name: X, dtype: float64

In [40]:
df.X

1   -23.070763
2    -4.182866
3   -13.213801
4   -16.299881
Name: X, dtype: float64

In [41]:
columnas=['W','Y']
df[ columnas]

           W          Y
1 -21.996734 -17.592977
2 -15.645949 -13.215380
3  -6.775287 -22.037174
4   2.745450 -14.938832

In [42]:
df['suma_X_Z'] = df.X+ df.Z
df

           W          X          Y          Z   suma_X_Z
1 -21.996734 -23.070763 -17.592977  -2.166173 -25.236936
2 -15.645949  -4.182866 -13.215380  -9.378976 -13.561843
3  -6.775287 -13.213801 -22.037174 -27.547795 -40.761596
4   2.745450 -16.299881 -14.938832  -9.709094 -26.008975

In [ ]:
df.drop('Y', axis=1, inplace= True) #axis=1 es para borrar columnas, axis=0 es para borrar

In [53]:
df

           W          X          Z   suma_X_Z
1 -21.996734 -23.070763  -2.166173 -25.236936
2 -15.645949  -4.182866  -9.378976 -13.561843
3  -6.775287 -13.213801 -27.547795 -40.761596
4   2.745450 -16.299881  -9.709094 -26.008975

In [48]:
df.drop(3,axis=0)

           W          X         Z   suma_X_Z
1 -21.996734 -23.070763 -2.166173 -25.236936
2 -15.645949  -4.182866 -9.378976 -13.561843
4   2.745450 -16.299881 -9.709094 -26.008975

In [54]:
df.loc[1]

W          -21.996734
X          -23.070763
Z           -2.166173
suma_X_Z   -25.236936
Name: 1, dtype: float64

In [55]:
df.iloc[0,2]

np.float64(-2.166173029164441)

In [59]:
df.loc[[2, 4], ['X','suma_X_Z']]

           X   suma_X_Z
2  -4.182866 -13.561843
4 -16.299881 -26.008975